/*******************************************************
文件名:main.c
版本号:v1.0
创建日期:2013-10-23
作者：楼燚航
主要函数描述：
********************************************************/

#include "HC_SR04.h"

/**************************** 
      配置时钟晶振函数 
*****************************/ 
void SysClkSet32M()
{
    CLKCONCMD &= ~0x40;         //设置系统时钟源为32MHZ晶振
    while(CLKCONSTA & 0x40);     //等待晶振稳定
    CLKCONCMD &= ~0x47;        //设置系统主时钟频率为32MHZ
                               //此时的CLKCONSTA为0x88。即普通时钟和定时器时钟都是32M。     
}

/**************************** 
     延时10us函数 
*****************************/ 
void Delay_10us() //10 us延时
{
   uchar i;
   for(i=0;i<9;i++)
   asm("NOP");
}

/**************************** 
      延时xms函数 
*****************************/ 
void Delayms(uint xms)
{
  uint i,j;
  for(i=xms;i>0;i--)
    for(j=587;j>0;j--);
}

/**************************** 
      初始化IO口 
*****************************/ 
void Init_GPIO(void)
{
  P1DIR |= 0x80;
  P1DIR &= ~0x08;
}

/**************************** 
      初始化定时器T1 
*****************************/ 
void Init_T1(void)
{
  T1CTL = 0x05;	
  T1STAT= 0x21;          //通道0,中断有效,8分频;自动重装模式(0x0000->0xffff) 
  T1CNTL=0x0000;
  T1CNTH=0x0000;
}

/**************************** 
      外部中断方式中断配置 
*****************************/ 
void Init_Key1(void)
{
  P1IEN |= 0X08;
  PICTL &= ~0X01; // 上升沿触发   
  IEN2 |= 0X10;   // 允许P0口中断; 
  P1IFG = 0x08;   // 初始化中断标志位
  EA = 1; 
}





